In [13]:
import pandas as pd
import openpyxl
import glob

In [14]:
folder = glob.glob('D:\\DATA KANTOR\MASTERFILE\\xlsx\\*.xlsx')

In [15]:
data = pd.DataFrame()
for file in folder:
    df = pd.read_excel(file, engine='openpyxl')
    data = data.append(df)

In [16]:
data.head()

,No,NPWP,Nama WP,Kode KLU,Status WP,Tgl.Daftar,NIP,Nama,Seksi
0,1,01.332.992.5-006.000,BUMIMITRA ADIPERSADA,43211,Aktif,15/12/2005,60091846,Abdul Kohar,Waskon II
1,2,01.608.613.4-006.000,TILAYORA PERDANA,45301,Aktif,17/12/1992,60091846,Abdul Kohar,Waskon II
2,3,01.759.490.4-006.000,DAYA TUNAS CEMERLANG,46421,Aktif,1997-11-04 00:00:00,60091846,Abdul Kohar,Waskon II
3,4,01.882.255.1-006.000,ANASTASIA PUTRI,41019,Aktif,27/05/1999,60091846,Abdul Kohar,Waskon II
4,5,01.992.576.7-027.000,PRIMA MITRA SETIA SEJATI,81210,Aktif,2000-05-07 00:00:00,60091846,Abdul Kohar,Waskon II

In [19]:
data.to_csv('D:\DATA KANTOR\MASTERFILE\FIX\MFWPSEKANWIL.csv')